       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOB01.
      **********************************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = KIVIA(ALURA) KIVIAAL
      *OBJETIVO: MOSTRAR A STRING HELLO ALURA
      *DATA   = 05/01/22
      **********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO ALURA'.
           STOP RUN.
